backend/app/models/user.rb

INSERT INTO `relationships` (`user_id`, `follow_id`, `created_at`, `updated_at`) VALUES (10, 13, '2020-06-11 08:03:49', '2020-06-11 08:03:49')
SELECT  `relationships`.* FROM `relationships` WHERE `relationships`.`user_id` = 10 AND `relationships`.`follow_id` = 13 LIMIT 1
---
  def follow(other_user)
    unless self == other_user
      self.relationships.find_or_create_by(follow_id: other_user.id)

SELECT  `relationships`.* FROM `relationships` WHERE `relationships`.`user_id` = 10 AND `relationships`.`follow_id` = 13 LIMIT 1
DELETE FROM `relationships` WHERE `relationships`.`id` = 9
---
  def unfollow(other_user)
    relationship = self.relationships.find_by(follow_id: other_user.id)
    relationship.destroy if relationship

SELECT  1 AS one FROM `users` INNER JOIN `relationships` ON `users`.`id` = `relationships`.`follow_id` WHERE `relationships`.`user_id` = 1 AND `users`.`id` = 10 LIMIT 1
---
  def following?(other_user)
    self.followings.include?(other_user)