backend/app/controllers/api/comments_controller.rb

INSERT INTO `comments` (`message`, `user_id`, `post_id`, `created_at`, `updated_at`) VALUES ('空いてました！', 1, 4, '2020-06-10 12:04:35', '2020-06-10 12:04:35')
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 5
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 5 LIMIT 1
---
    def create
      comment = Comment.new(comment_params)
      if comment.save
        post = Post.find(comment.post.id)

SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 8 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 8
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 5 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 5
---
    def destroy
      comment = Comment.find(params[:id])
      if comment.destroy
        post = Post.find(comment.post.id)