backend/app/controllers/api/posts_controller.rb

INSERT INTO `posts` (`title`, `content`, `shop_name`, `shop_address`, `shop_access`, `shop_url`, `user_id`, `created_at`, `updated_at`) VALUES ('誰か行きましょう', 'この店凄い美味しかったです！誰か一緒に行きましょう！', '旬魚鮮肉×産地直営 北海道幾蔵 上野本店', '〒110-0005 東京都台東区上野2-8-4 B1', 'ＪＲ上野駅から徒歩3分', 'https://r.gnavi.co.jp/pt78t4rs0000/?ak=3J8m0cDqHhvcifLZFnFt5zb%2FNAHSG8kDePr8c7yIB58%3D', 13, '2020-06-09 14:59:17', '2020-06-09 14:59:17')
---
    def following_posts
      posts = Post.where(user_id: @user.followings.ids.push(@user.id)).order(created_at: "DESC")

INSERT INTO `posts` (`title`, `content`, `shop_name`, `shop_address`, `shop_access`, `shop_url`, `shop_image_url`, `user_id`, `created_at`, `updated_at`, `shop_category`) VALUES ('', '雰囲気も良くて最高の店でした。', '完全個室×肉寿司専門店 クォッカ‐CUOCA‐ 新宿西口店', '〒160-0023 東京都新宿区西新宿1-4-1 プリンスビルB2', '都営大江戸線新宿西口駅から徒歩1分', 'https://r.gnavi.co.jp/1jmuzzdc0000/?ak=3J8m0cDqHhvcifLZFnFt5zb%2FNAHSG8kDePr8c7yIB58%3D', 'https://rimage.gnst.jp/rest/img/1jmuzzdc0000/t_0n5f.jpg', 1, '2020-06-10 09:28:01', '2020-06-10 09:28:01', '新宿西口 個室居酒屋')
---
    def follower_posts
      posts = Post.where(user_id: @user.followers.ids.push(@user.id)).order(created_at: "DESC")

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 5 LIMIT 1
---
    def show
      post = Post.find(params[:id])

INSERT INTO `posts` (`title`, `content`, `shop_name`, `shop_address`, `shop_access`, `shop_url`, `shop_image_url`, `user_id`, `created_at`, `updated_at`, `shop_category`) VALUES ('', '美味しそうです！誰か一緒に行きましょう！', '全席個室×旬鮮魚×新潟地酒 佐渡ヶ島へ渡れ 名駅店', '〒450-0002 愛知県名古屋市中村区名駅3-22-8 大東海ビルB1', 'ＪＲ名古屋駅から徒歩5分', 'https://r.gnavi.co.jp/brtzbzx40000/?ak=3J8m0cDqHhvcifLZFnFt5zb%2FNAHSG8kDePr8c7yIB58%3D', 'https://rimage.gnst.jp/rest/img/brtzbzx40000/t_0000.jpg', 13, '2020-06-10 03:10:02', '2020-06-10 03:10:02', '名駅 個室 海鮮居酒屋')
---
    def create
      post = Post.new(post_params)
      if post.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 13 LIMIT 1
---
    def set_user
      @user = User.find(params[:user_id])