backend/app/controllers/api/posts_controller.rb

    def index
      posts = Post.all
---
SELECT `posts`.* FROM `posts`