backend/app/controllers/api/relationships_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 10 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 13 LIMIT 1
---
    def set_user
      @current_user = User.find(params[:user_id])
      @user = User.find(params[:follow_id])